app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "heyyyyyyy"], ["user_id", 1], ["created_at", "2022-05-18 06:40:32.144947"], ["updated_at", "2022-05-18 06:40:32.144947"], ["picture", "bennysnare.jpeg"]]
---
  def create
    p "in create"
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save